results/factorial-final/security-overhead-final-plaintext-broker3/security-overhead-final-factorial-plaintext-b3-rf3-isr3-msg102400-tps1000-batch16384-acksall-prod12-compnone-trial1/producer-perf-12.log
producer_index=12
producer_count=12
producer_records=8333
producer_throughput=83
1 records sent, 0.1 records/sec (0.01 MB/sec), 8176.0 ms avg latency, 8176.0 ms max latency.
336 records sent, 66.6 records/sec (6.50 MB/sec), 773.6 ms avg latency, 1541.0 ms max latency.
322 records sent, 64.2 records/sec (6.27 MB/sec), 129.6 ms avg latency, 427.0 ms max latency.
348 records sent, 69.6 records/sec (6.79 MB/sec), 83.4 ms avg latency, 214.0 ms max latency.
401 records sent, 80.0 records/sec (7.81 MB/sec), 67.8 ms avg latency, 182.0 ms max latency.
433 records sent, 86.6 records/sec (8.46 MB/sec), 32.6 ms avg latency, 151.0 ms max latency.
472 records sent, 94.2 records/sec (9.20 MB/sec), 25.9 ms avg latency, 79.0 ms max latency.
466 records sent, 92.9 records/sec (9.07 MB/sec), 24.8 ms avg latency, 84.0 ms max latency.
437 records sent, 86.9 records/sec (8.49 MB/sec), 26.7 ms avg latency, 76.0 ms max latency.
427 records sent, 84.6 records/sec (8.26 MB/sec), 30.5 ms avg latency, 154.0 ms max latency.
435 records sent, 87.0 records/sec (8.50 MB/sec), 28.6 ms avg latency, 92.0 ms max latency.
425 records sent, 84.9 records/sec (8.29 MB/sec), 34.2 ms avg latency, 292.0 ms max latency.
448 records sent, 89.4 records/sec (8.73 MB/sec), 28.4 ms avg latency, 126.0 ms max latency.
388 records sent, 77.4 records/sec (7.56 MB/sec), 114.7 ms avg latency, 810.0 ms max latency.
483 records sent, 95.9 records/sec (9.37 MB/sec), 428.8 ms avg latency, 1544.0 ms max latency.
417 records sent, 82.8 records/sec (8.08 MB/sec), 25.8 ms avg latency, 165.0 ms max latency.
437 records sent, 87.0 records/sec (8.50 MB/sec), 24.0 ms avg latency, 83.0 ms max latency.
408 records sent, 81.0 records/sec (7.91 MB/sec), 22.8 ms avg latency, 122.0 ms max latency.
436 records sent, 87.0 records/sec (8.50 MB/sec), 24.1 ms avg latency, 91.0 ms max latency.
436 records sent, 87.1 records/sec (8.50 MB/sec), 25.5 ms avg latency, 110.0 ms max latency.
8333 records sent, 76.937281 records/sec (7.51 MB/sec), 93.78 ms avg latency, 8176.00 ms max latency, 27 ms 50th, 641 ms 95th, 1163 ms 99th, 1468 ms 99.9th.